<a href="https://colab.research.google.com/github/jcval94/Actuarial-Functions/blob/master/ClaseSQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
create database ejemplo2;
	use ejemplo2;

		CREATE TABLE User2 (
			  email varchar(55), 
			  first_name varchar(45), 
			  last_name varchar(45), 
			  address varchar(145), 
			  age int, 
			  PRIMARY KEY (email)
			);
            
		
		Select * from User2;
        INSERT INTO User2 VALUES ('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasy City', 21);
		INSERT INTO User2 VALUES ('tom@web.com', 'Tom', 'Fake', '456 Fantasy lane, Fantasy City', 39);
		SELECT * FROM user2 WHERE age = 39;
        
        Select * from User2;
        
        SELECT email, age FROM user2 ORDER BY age DESC;
        
        ALTER TABLE user2 ADD COLUMN gender varchar(1);
        
        UPDATE user2 SET gender='M' WHERE user2.email='bob@example.com';
        UPDATE user2 SET gender='M' WHERE user2.email<>'bob@example.com';
        UPDATE user2 SET gender='F' WHERE NOT user2.email='bob@example.com';
        
        SELECT email, gender FROM user2;
        
        SELECT email, gender, age FROM user2 ORDER BY age DESC;
        
        INSERT INTO user2 VALUES('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F');